-- phpMyAdmin SQL Dump
-- version 4.0.8
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Мар 19 2017 г., 10:54
-- Версия сервера: 5.6.14-log
-- Версия PHP: 5.5.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `periodic_table`
--

-- --------------------------------------------------------

--
-- Структура таблицы `Compound`
--

CREATE TABLE IF NOT EXISTS `Compound` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) NOT NULL,
  `brutto` varchar(32) NOT NULL,
  `smiles` varchar(50) NOT NULL,
  `experimental_factor` double NOT NULL,
  `prediction_factor` double NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=116 ;

--
-- Дамп данных таблицы `Compound`
--

INSERT INTO `Compound` (`id`, `name`, `brutto`, `smiles`, `experimental_factor`, `prediction_factor`) VALUES
(1, 'Акрилонитрил', 'C3H3N', 'C=CC#N', 3, 2.94),
(2, 'Аллиламин', 'C3H7N', 'C=CCN', 2.2, 2.36),
(3, 'Аллилен', 'C3H4', 'CC#C', 1.7, 1.93),
(4, 'Амилацетат', 'C7H14O2', 'CCCCCOC(=O)C', 1.08, 1.16),
(5, 'Амилбромид', 'C5H11Br', 'CCCCCBr', 2.2, 2.09),
(6, 'Амиловый спирт', 'C5H12O', 'CCCCCO', 1.48, 1.51),
(7, 'Амилхлорид', 'C5H11Cl', 'CCC(C)(Cl)C', 1.5, 1.53),
(8, 'Аминобифенил', 'C12H11N', 'C1=CC=C(C=C1)C2=CC=CC=C2N', 0.75, 0.74),
(9, 'Аммиак', 'NH3', 'N', 17, 16.38),
(10, 'Анилин', 'C6H7N', 'C1=CC=C(C=C1)N', 1.32, 1.41),
(11, 'Ацетальдегид', 'C2H4O', 'CC=O', 4.1, 3.75),
(12, 'Ацетанилид', 'C8H9NO', 'CC(=O)NC1=CC=CC=C1', 1, 1.1),
(13, 'Ацетилен', 'C2H2', 'C#C', 2.5, 2.22),
(14, 'Ацетон', 'C3H6O', 'CC(=O)C', 2.91, 2.79),
(15, 'Ацетонитрил', 'C2H3N', 'CC#N', 4.1, 4.15),
(16, 'Ацетонциангидрин', 'C4H7NO', 'CC(C)(O)C#N', 2.2, 2.17),
(17, 'Бензол', 'C6H6', 'C1=CC=CC=C1', 1.43, 1.4),
(18, 'Бутан', 'C4H10', 'CCCC', 1.8, 1.75),
(19, 'Бутен-1', 'C4H8', 'CCC=C', 1.81, 1.8),
(20, 'Бутен-2', 'C4H8', 'CC=CC', 1.82, 1.82),
(21, 'Бутиламин', 'C4H11N', 'CCCCN', 1.7, 1.73),
(22, 'Бутилацетат', 'C6H12O2', 'CCCCOC(=O)C', 1.43, 1.37),
(23, 'Бутилбромид', 'C4H9Br', 'CCCCBr', 2.8, 2.76),
(24, 'Бутиловый спирт', 'C4H10O', 'ССССО', 1.81, 1.86),
(25, 'Бутилхлорид', 'C4H9Cl', 'CCCCCl', 1.9, 1.9),
(26, 'Валериановая кислота', 'C5H10O2', 'CCCCC(O)=O', 1.97, 1.72),
(27, 'Винилхлорид', 'C2H3Cl', 'C=CCl', 4, 4.09),
(28, 'Гексадекан', 'C16H34', 'CCCCCCCCCCCCCCCC', 0.47, 0.47),
(29, 'Гексан', 'C6H14', 'CCCCCC', 1.24, 1.21),
(30, 'Гексилбромид', 'C6H13Br', 'CCCCCCBr', 1.6, 1.67),
(31, 'Гексиловый спирт', 'C6H14O', 'CCCCCCO', 1.23, 1.26),
(32, 'Гексилхлорид', 'C6H13Cl', 'CCCCCCCl', 1.2, 1.28),
(33, 'Гептан', 'C7H16', 'CCCCCCC', 1.07, 1.04),
(34, 'Гептилхлорид?', 'C7H15Cl', 'CCCCCCCCl', 1, 1.07),
(35, 'Глицерин', 'C3H8O3', 'C(C(CO)O)O', 3.1, 3.01),
(36, 'Декан', 'C10H22', 'CCCCCCCCCC', 0.76, 0.74),
(37, 'Дивинил', 'C4H6', 'C=CC=C', 2.02, 1.88),
(38, 'Дивиниловый эфир', 'C4H6O', 'C=COC=C', 2, 1.93),
(39, 'Диметиламин', 'C2H7N', 'CNC', 2.8, 2.94),
(40, 'Диметиланилин', 'C8H11N', 'CN(C)C1=CC=CC=C1', 1.01, 0.98),
(41, 'Диметилформамид', 'C3H7NO', 'CN(C)C=O', 2.35, 2.19),
(42, 'Диметиловый спирт', 'C2H6O', 'COC', 3.5, 3.44),
(43, 'Диоксан', 'C4H8O2', 'COC', 2.14, 2.1),
(44, 'Дифениламин', 'C12H11N', 'C1=CC=C(C=C1)NC2=CC=CC=C2', 0.73, 0.73),
(45, 'Дихлорэтан', 'C2H4Cl2', 'CC(Cl)Cl', 4.6, 4.47),
(46, 'Диэтиламин', 'C4H11N', 'CCNCC', 1.77, 1.67),
(47, 'Диэтиловый эфир', 'C4H10O', 'CCOCC', 1.9, 1.78),
(48, 'Додекан', 'C12H26', 'CCCCCCCCCCCC', 0.63, 0.63),
(49, 'Диэтилциклогексан', 'C10H20', 'CCC1(CC)CCCCC1', 0.75, 0.76),
(50, 'Изобутан', 'C4H10', 'CC(C)CO', 1.81, 1.75),
(51, 'Изобутилен', 'C4H8', 'CC(=C)C', 1.78, 1.81),
(52, 'Изобутиловый спирт', 'C4H10O', 'CC(C)CO', 1.81, 1.86),
(53, 'Изооктан', 'C8H18', 'CC(C)CC(C)(C)C', 1, 0.92),
(54, 'Изопентан', 'C5H12', 'CCC(C)C', 1.38, 1.43),
(55, 'Изопрен', 'C5H8', 'CC(=C)C=C', 1.7, 1.56),
(56, 'Изопропиловый спирт', 'C3H8O', 'CC(C)O', 2.23, 2.45),
(57, 'Капролактам', 'C6H11NO', 'C1CCC(=O)NCC1', 1.3, 1.37),
(58, 'Кротонилен', 'C4H6', 'CC#CC', 1.4, 1.59),
(59, 'Ксилидин', 'C8H11N', 'CC1=CC(=C(C=C1)N)C', 1, 1.03),
(60, 'Ксилол', 'C8H10', 'CC1=CC=CC=C1C', 1, 1.03),
(61, 'Кумол', 'C9H12', 'CC(C)C1=CC=CC=C1', 0.93, 0.91),
(62, 'Метан', 'CH4', 'C', 5.28, 5.36),
(63, 'Метанол', 'CH4O', 'CO', 6.7, 6.84),
(64, 'Метиламин', 'CH5N', 'CN', 4.9, 5.14),
(65, 'Метилпропилкетон', 'C5H10O', 'CCCC(=O)C', 1.49, 1.62),
(66, 'Метилэтилкетон', 'C4H8O', 'CCC(=O)C', 1.9, 2.07),
(67, 'Нафталин', 'C10H8', 'C1=CC=C2C=CC=CC2=C1', 0.91, 0.92),
(68, 'Неогексан', 'C6H14', 'CCC(C)(C)C', 1.2, 1.2),
(69, 'Неопентан', 'C5H12', 'CC(C)(C)C', 1.4, 1.41),
(70, 'Никотин', 'C10H14N2', 'CN1CCCC1C2=CN=CC=C2', 0.75, 0.81),
(71, 'Нитрометан', 'CH3NO2', 'CN(=O)O', 7.3, 6.72),
(72, 'Нитропропан', 'C3H7NO2', 'CCCN(=O)O', 2.2, 2.42),
(73, 'Нитроэтан', 'C2H5NO2', 'CCN(=O)O', 3.4, 3.53),
(74, 'Нонан', 'C9H20', 'CCCCCCCCC', 0.84, 0.82),
(75, 'Окись этилена', 'C2H4O', 'C1CO1', 3.66, 3.82),
(76, 'Октан', 'C8H18', 'CCCCCCCC', 0.94, 0.92),
(77, 'Пентадекан', 'C15H32', 'CCCCCCCCCCCCCCC', 0.51, 0.5),
(78, 'Пентан', 'C5H12', 'CCCCC', 1.47, 1.43),
(79, 'Пентан-1', 'C5H10', 'CCCC=C', 1.49, 1.47),
(80, 'Пиколин', 'C6H7N', 'CC1=CC=CC=N1', 1.43, 1.44),
(81, 'Пиридин', 'C5H5N', 'C1=CC=NC=C1', 1.85, 1.77),
(82, 'Пропан', 'C3H8', 'CCC', 2.31, 2.25),
(83, 'Пропаргиловый спирт', 'C3H4O', 'C#CCO', 2.4, 2.23),
(84, 'Пропиламин', 'C3H9N', 'CCCN', 2, 2.09),
(85, 'Пропилбромид', 'C3H7Br', 'CCCBr', 4, 3.97),
(86, 'Пропилен', 'C3H6', 'CC=C', 2.3, 2.36),
(87, 'Пропиловый спирт', 'C3H8O', 'CCCO', 2.34, 2.45),
(88, 'Пропилхлорид', 'C3H7Cl', 'CCCCl', 2.5, 2.52),
(89, 'Стирол', 'C8H8', 'C=CC1=CC=CC=C1', 1.06, 1.05),
(90, 'Тетрагидрофуран', 'C4H8O', 'C1CCOC1', 1.78, 1.93),
(91, 'Тетрадекан', 'C14H30', 'CCCCCCCCCCCCCC', 0.54, 0.54),
(92, 'Толуилендиизоцианат', 'C9H6N2O2', 'CC1=C(C=C(C=C1)N=C=O)N=C=O', 0.9, 0.96),
(93, 'Толуол', 'C6H5CH3', 'CC1=CC=CC=C1', 1.25, 1.12),
(94, 'Третбутиламин', 'C4H11N', 'CCCCN', 1.7, 1.73),
(95, 'Тридекан', 'C13H28', 'CCCCCCCCCCCCC', 0.58, 0.58),
(96, 'Триметиламин', 'C3H9N', 'CN(C)C', 2, 2.03),
(97, 'Триэтиламин', 'C6H15N', 'CCN(CC)CC', 1.2, 1.14),
(98, 'Уксусная кислота', 'C2H4O2', 'CC(=O)O', 5.5, 5.19),
(99, 'Ундекан', 'C11H24', 'CCCCCCCCCCC', 0.69, 0.68),
(100, 'Формальдегид', 'CH2O', 'C=O', 7, 7.12),
(101, 'Фталевый ангидрид', 'C8H4O3', 'C1=CC=C2C(=C1)C(=O)OC2=O', 1.32, 1.39),
(102, 'Хинолин', 'C9H7N', 'C1=CC=C2C(=C1)C=CC=N2', 1, 1.06),
(103, 'Хлорбензол', 'C6H5Cl', 'C1=CC=C(C=C1)Cl', 1.4, 1.51),
(104, 'Циклогексан', 'C6H12', 'C1CCCCC1', 1.31, 1.27),
(105, 'Этан', 'C2H6', 'CC', 3.07, 3.17),
(106, 'Этанол', 'C2H6O', 'CCO', 3.61, 3.57),
(107, 'Этилацетат', 'C4H8O2', 'CCOC(=O)C', 2.28, 2.12),
(108, 'Этилбензол', 'C8H10', 'CCC1=CC=CC=C1', 1.03, 1.03),
(109, 'Этилбромид', 'C2H5Br', 'CCBr', 6.7, 6.8),
(110, 'Этилен', 'C2H4', 'C=C', 3.11, 3.39),
(111, 'Этиленгликоль', 'C2H6O2', 'C(CO)O', 4.29, 4.14),
(112, 'Этиленимин', 'C2H5N', 'C1CN1', 3.6, 3.33),
(113, 'Этилнитрат', 'C2H5NO3', 'CCON(=O)O', 4, 4.32),
(114, 'Этилхлорид', 'C2H5Cl', 'CCCl', 3.92, 3.73),
(115, 'Этилцеллозольв', 'C4H10O2', 'CCOCCO', 2, 2.1);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
